# 91. Словник учня
# Створіть словник з даними учня: ключі "ім'я", "вік", "клас". Виведіть кожне поле
# окремим рядком.
# Підказка: Зверніться до значень через student["ім'я"] тощо.
from yaml import MarkedYAMLError

student = {
    "name": "John",
    "age": 15,
    "class": "10"
}

print("Student name: ", student["name"])
print("Age: ", student["age"])
print("Class: ", student["class"])

# 92. Всі ключі
# Маючи довільний словник, виведіть усі його ключі.
# Підказка: Використайте dict.keys() або ітеруйте: for key in d.

print("Keys for student dict: ", student.keys())

# 93. Всі значення
# Маючи довільний словник, виведіть усі його значення.
# Підказка: Використайте dict.values().

print("Values for student dict: ", student.values())

# 94. Додавання елемента
# Маючи словник, додайте до нього новий ключ-значення. Виведіть оновлений словник.
# Підказка: d["новий_ключ"] = "значення"

student["city"] = "Kyiv"  # додаємо новий ключ
print(student)

# 95. Видалення елемента
# Маючи словник, видаліть із нього елемент за ключем. Виведіть оновлений словник.
# Підказка: del d["ключ"] або d.pop("ключ").

student.pop("city")
print(student)

# 96. Перевірка ключа
# Введіть ключ з клавіатури. Перевірте, чи є він у словнику, і виведіть відповідь.
# Підказка: Використайте оператор in: "ключ" in d.

key = input("Enter key ")
if key in student:
    print(f"Key {key} is in dictionary")
else:
    print("Key was not found")

# 97. Значення за ключем
# Введіть ключ. Знайдіть та виведіть відповідне значення або повідомлення "не
# знайдено".
# Підказка: Використайте d.get("ключ", "не знайдено").

key = input("Enter key ")
print(student.get(key, "not found"))


# 98. Оновлення значення
# Маючи словник, змініть значення одного з ключів на нове. Виведіть оновлений
# словник.
# Підказка: d["ключ"] = нове_значення

student["class"] = 11
print(student)

# 99. Кількість елементів
# Виведіть кількість пар ключ-значення у словнику.
# Підказка: len(d) повертає кількість елементів.

print(f"There are {len(student)} elements in the dictionary")
# 100. Мінісловник перекладу
# Створіть словник, де ключі — слова однією мовою, значення — їх переклад. Введіть
# слово і виведіть переклад або "слово не знайдено".
# Підказка: d = {"кіт": "cat", "собака": "dog", ...}. Використайте d.get(word, "не знайдено").

my_dictionary = {
    "кіт": "cat",
    "собака": "dog",
    "птиця": "bird",
    "павук":"spider"
    }

word = input("Enter word ")
print(f"Translation of the  word {word}: {my_dictionary.get(word, 'not found')}")
