# Вкладені цикли
# 41. Трикутник зі зірочок
# Виведіть прямокутний трикутник із символів *: перший рядок — 1 зірочка, другий — 2,
# і так далі до N.
# Підказка: for i in range(1, N+1): print("*" * i).

for i in range(1, 11):
    print("*" * i)

print()

# 42. Перевернутий трикутник
# Введіть N. Виведіть трикутник у зворотному порядку: перший рядок — N зірочок,
# останній — 1.
# Підказка: for i in range(N, 0, -1): print("*" * i).

for i in range(11, 0, -1):
    print("*" * i)

# 43. Ялинка
# Виведіть ялинку: кожен рядок центрований і містить непарну кількість зірочок (1, 3, 5,
# ...).
# Підказка: Ширина рядка i = 2*i-1 зірочок, відступ = N-i пробілів.

n= 11

for i in range(1, n + 1):
    print(("*" * (2 * i - 1)).center(2 * n - 1))


# 44. Таблиця множення 10×10
# Виведіть повну таблицю множення від 1 до 10 у вигляді сітки (рядки і стовпці).
# Підказка: Два вкладені цикли for i in range(1,11) і for j in range(1,11). Форматуйте вивід
# через f-string або .format().

for i in range(1,11):
    for j in range(1,11):
        print(f"{i*j}", end = '\t')
    print("\n")


# 45. Усі пари чисел
# Виведіть усі можливі пари (i, j), де i та j — числа від 1 до 5.
# Підказка: Два вкладені цикли; виводьте кожну пару у форматі "(i, j)".


for i in range(1,6):
    for j in range(1,6):
        print(f"{i, j}", end = '\t')
    print("\n")


# 46. Дільники числа
# Введіть число N. Знайдіть і виведіть усі його дільники (числа, на які N ділиться без
# остачі).
# Підказка: Перевіряйте N % i == 0 для i від 1 до N.

number = int(input("Enter number "))

for i in range(1, number):
    if number % i ==0:
        print(i)


# 47. Просте число
# Введіть число N. Визначте, чи є воно простим, і виведіть відповідь.
# Підказка: Просте число ділиться лише на 1 і на себе. Перевіряйте дільники від 2 до N-1 або
# до sqrt(N).

# 48. Прості числа до N
# Введіть число N. Виведіть усі прості числа від 2 до N.
# Підказка: Для кожного числа від 2 до N перевіряйте простоту вкладеним циклом або
# алгоритмом решета Ератосфена.


# 49. Шахова дошка
# Виведіть шахову дошку 8×8 із символів # та пробілу, що чергуються.
# Підказка: Якщо сума (i + j) парна — виводьте "#", інакше — " " (або навпаки).

for i in range(1,9):
    for j in range(1,9):
        if (i+j) % 2 ==0:
            print("#", end="")
        else:
            print("@", end="")
    print()

# 50. Числовий трикутник
# Введіть N. Виведіть трикутник, де в i-му рядку знаходяться числа від 1 до i.
# Підказка: Рядок 1: "1", рядок 2: "1 2", рядок 3: "1 2 3" тощо.

n = int(input("Enter number "))

for i in range(1, n):
    for j in range(1,i+1):
        print(j, end="")
    print()
