# Цикл for
# 31. Числа від 1 до 100
# За допомогою циклу for виведіть усі числа від 1 до 100.
# Підказка: Використайте range(1, 101).

# 32. Парні числа до 100
# За допомогою for виведіть усі парні числа від 1 до 100.
# Підказка: Використайте range(2, 101, 2) або перевірку n % 2 == 0.

for i in range(2, 101, 2):
    print(i, " ", end = "")
print()


# 33. Непарні числа до 100
# За допомогою for виведіть усі непарні числа від 1 до 100.
# Підказка: Використайте range(1, 101, 2) або перевірку n % 2 != 0.

for i in range(1, 101, 2):
    print(i, " ", end = "")
print()

# 34. Сума від 50 до 100
# За допомогою for обчисліть суму всіх цілих чисел від 50 до 100 включно.
# Підказка: range(50, 101) — правий кінець не включається.

sum = 0
for i in range(50,101):
    sum+=i

print(sum)

# 35. Сума квадратів
# Введіть число N. Обчисліть суму квадратів чисел від 1 до N: 1² + 2² + ... + N².
# Підказка: Додавайте i**2 на кожному кроці циклу.


# 36. Степені двійки
# Введіть число N. Виведіть усі степені двійки від 2⁰ до 2^N.
# Підказка: Виводьте 2**i для i від 0 до N включно.

# 37. Кратні числа
# За допомогою for порахуйте, скільки чисел від 1 до 100 кратні 7.
# Підказка: Умова кратності: n % 7 == 0. Використайте лічильник.

count = 0
for i in range(1,101):
    if i % 7 ==0:
        count+=1

print(count)

# 38. Таблиця множення 1–10
# Виведіть повну таблицю множення від 1 до 10 у вигляді рядків: "i * j = результат".
# Підказка: Зовнішній цикл — множник i (1–10), внутрішній — множник j (1–10). Але для цього
# завдання достатньо одного циклу (обирайте самі).


# 39. Квадрат із символів
# Введіть розмір N. Намалюйте квадрат N×N із символів *.
# Підказка: Виводьте рядок з N зірочок N разів: print("*" * N).

n = int(input("Enter n "))

for i in range(1, n+1):
    print(("* " * n))

# 40. Прямокутник
# Введіть ширину та висоту. Намалюйте прямокутник відповідного розміру із символів *.
# Підказка: Зовнішній цикл — рядки (висота), виводьте рядок з ширина зірочок.

h = int(input("Enter height "))
w = int(input("Enter width "))

for i in range(1, h+1):
    for j in range(1, w+1):
        print("*", end = " ")
    print()
