# 51. Символи на окремих рядках
# Введіть рядок. Виведіть кожен символ на окремому рядку.
# Підказка: Ітеруйте по рядку: for ch in text: print(ch).
text = "sql requests"

for w in text:
    print(f"{w}")

# 52. Довжина рядка
# Введіть рядок. Порахуйте і виведіть кількість символів у ньому без використання len().
# Підказка: Використайте лічильник і цикл for.

qty = 0
for w in text:
    qty+=1

print(qty)

# 53. Кількість голосних
# Введіть рядок. Порахуйте кількість голосних літер (a, e, i, o, u та їх українські
# відповідники).
# Підказка: Перевіряйте ch.lower() in "аеиіоуяюєїaeiou".


# 54. Кількість пробілів
# Введіть рядок. Порахуйте і виведіть кількість пробілів у ньому.
# Підказка: Перевіряйте ch == " " або використайте text.count(" ").
# 55. Наявність слова Python
# Введіть рядок. Перевірте, чи містить він слово "Python", і виведіть відповідь.
# Підказка: Використайте оператор in: "Python" in text.
# 56. Заміна пробілів
# Введіть рядок. Замініть у ньому всі пробіли символом "_" і виведіть результат.
# Підказка: Використайте метод text.replace(" ", "_").

print(text.replace(" ", "_"))

# 57. Верхній регістр
# Введіть рядок. Перетворіть усі літери у верхній регістр і виведіть результат.
# Підказка: Використайте метод text.upper().

print(text.upper())

# 58. Нижній регістр
# Введіть рядок. Перетворіть усі літери у нижній регістр і виведіть результат.
# Підказка: Використайте метод text.lower().
# 59. Паліндром
# Введіть рядок. Визначте, чи є він паліндромом (читається однаково з обох боків).
# Ігноруйте регістр і пробіли.
# Підказка: Очистіть рядок: s = text.lower().replace(" ",""). Порівняйте s == s[::-1].



# 60. Кількість входжень літери
# Введіть рядок і окрему літеру. Порахуйте і виведіть, скільки разів ця літера
# зустрічається в рядку.
# Підказка: Використайте text.lower().count(letter.lower()).

letter = "e"

print(text.lower().count(letter.lower()))
