# while
# 21. Числа від 1 до 20
# Використовуючи цикл while, виведіть усі числа від 1 до 20 через пробіл або кожне на
# новому рядку.
# Підказка: Ініціалізуйте лічильник i = 1, збільшуйте на 1 поки i <= 20.

i = 1
while i <= 20:
    print(i, end = " ")
    i += 1


# 22. Числа від 20 до 1
# Використовуючи цикл while, виведіть усі числа від 20 до 1 у зворотному порядку.
# Підказка: Ініціалізуйте i = 20, зменшуйте на 1 поки i >= 1.

i = 20
while i >= 1:
    print(i, end = " ")
    i -= 1

# 23. Сума від 1 до N
# Введіть число N. За допомогою while обчисліть і виведіть суму всіх чисел від 1 до N.
# Підказка: Накопичуйте суму: total += i на кожному кроці.

# 24. Добуток від 1 до N
# Введіть число N. За допомогою while обчисліть добуток усіх чисел від 1 до N
# (факторіал). # Підказка: Ініціалізуйте result = 1, множте на i на кожному кроці.

n = int(input("Enter n "))
if n < 0:
    print("Factorial is not defined for negative numbers")
else:
    i = 1
    f =1

    while i <=n:
        f*=i
        i+=1

    print(f)


# 25. Факторіал числа
# Введіть ціле невід'ємне число N. Обчисліть і виведіть його факторіал (N!).
# Підказка: Факторіал 0 і 1 дорівнює 1. Далі: n! = 1 * 2 * 3 * ... * n.

n = int(input("Enter n "))
if n < 0:
    print("Factorial is not defined for negative numbers")
elif n == 0:
    f = 1
    print(f)
else:
    i = 1
    f =1
    while i <=n:
        f*=i
        i+=1
    print(f)

# 26. Введення до нуля
# Постійно просіть користувача вводити числа, поки він не введе 0. Тоді завершіть
# програму.
# Підказка: Умова циклу: while True, вихід — break або while число != 0.

while n !=0:
    n= int(input("Enter number "))


# 27. Кількість введень
# Просіть вводити числа до введення 0. Порахуйте і виведіть кількість введених чисел
# (без нуля).
# Підказка: Використайте лічильник count, збільшуйте після кожного введення.
# 28. Сума введень
# Просіть вводити числа до введення 0. Порахуйте і виведіть суму всіх введених чисел
# (без нуля).
# Підказка: Накопичуйте суму total += число на кожній ітерації.


# 29. Вгадай число
# Програма «загадує» число від 1 до 100 (задайте у коді). Користувач вводить здогадки,
# отримуючи підказки «більше» або «менше». Виводьте кількість спроб.
# Підказка: Для випадкового числа можна використати import random та random.randint(1,
# 100).

import random

random_number = random.randint(1,100)
print(random_number)
n=1

attempts = int(input("Enter qty of attempts "))
while n <= attempts:
    your_number = int(input("Enter your number "))
    if your_number == random_number:
        print("You guessed!")
        break
    elif your_number > random_number:
        print("You number is greater than random number")
        continue
    else:
        print("You number is less than random number")
        continue


# 30. Таблиця множення (while)
# Введіть число N. За допомогою while виведіть таблицю множення для цього числа від
# 1 до 10.
# Підказка: Виводьте рядки виду: "N * i = результат"
