# # Завдання 1: «Комуналка за електроенергію»
# # Умова
# # Користувач вводить споживання електроенергії за місяць у кВтгод. Потрібно порахувати суму до
# # сплати за тарифними діапазонами.
# # Вимоги (що зробити)
# # Зчитати kwh (ціле число).
# # Порахувати оплату по частинах:
# # перші 100 кВт·год → 1.20 грн/кВт год
# # наступні 200 (тобто 101–300) → 1.50 грн/кВт·год
# # усе, що понад 300 → 1.80 грн/кВт год
# # Вивести:
# # загальну суму
# # окремо: скільки кВт·год у кожному діапазоні
# # Приклад вводу/виводу
# # Ввід (що вводять):
# # Введіть споживання (кВт·год): 350
# # Вивід (що вивести):
# # До 100: 100 кВт·год
# # 101-300: 200 кВт·год
# # Понад 300: 50 кВт·год
# # Сума: 525.0 грн
# # Додаткові коментарі (рекомендації)
# # Якщо kwh < 0 — вивести Помилка вводу.
# # Розв’язання тільки через if / elif / else і арифметику (без циклів, без методів).
#
# kwh = int(input("Введіть споживання електроенергії за місяць у кВтгод: "))
#
# if kwh <= 100:
#     total_100 = kwh * 1.20
#     print(f"До 100: {kwh} кВт·год")
#     print(f"Сума: {total_100} грн.")
# elif 101 <= kwh <= 300:
#     total_100 = 100 * 1.20
#     total_200 = (kwh - 100) * 1.50
#     total = total_100 + total_200
#     print(f"До 100: 100 кВт·год")
#     print(f"101-300: {kwh-100} кВт·год")
#     print(f"Сума: {total} грн.")
# elif kwh > 300:
#     total_100 = 100 * 1.20
#     total_200 = 200 * 1.50
#     total_300 = (kwh - 100 - 200)* 1.80
#     total = total_100 + total_200 + total_300
#     print(f"До 100: 100 кВт·год")
#     print(f"101-300: 200 кВт·год")
#     print(f"Понад 300: {kwh - 100-200} кВт·год")
#     print(f"Сума: {total} грн." )
# elif kwh < 0:
#     print("Помилка вводу")
#
#
# # Завдання 2: «Кінотеатр: ціна квитка»
# # Умова
# # Ціна квитка залежить від віку та дня тижня.
# # Вимоги (що зробити)
# # Зчитати:
# # age (int)
# # day (int, 1–7), де 6–7 — вихідні
# # Базова ціна:
# # будні (1–5) - 160 грн
# # вихідні (6–7) - 200 грн
# # Знижка за віком:
# # age < 6 → квиток безкоштовно (0 грн)
# # 6 <= age <= 12 - -50%
# # age >= 60 - -30%
# # інакше - без знижки
# # Вивести фінальну ціну.
# # Приклад вводу/виводу
# # Ввід (що вводять):
# # Введіть вік: 10
# # Введіть день тижня (1-7): 7
# # Вивід (що вивести):
# # Ціна квитка: 100 грн
# # Додаткові коментарі (рекомендації)
# # Якщо day не 1–7 або age < 0 - вивести Помилка вводу.
# # Не використовувати try/except і методи рядків.
#
# age = int(input("Введіть вік: "))
# day = int(input("Введіть день тижня (1-7): "))
# price_1 = 160
# price_2 = 200
# if 1<= day <=7 and age >=0:
#     if 1<= day <=5:
#         if age < 6:
#             ticket_price = 0
#         elif 6 <= age <= 12:
#             ticket_price = price_1 * 0.5
#         elif age >= 60:
#             ticket_price = price_1 * 0.7
#         else:
#             ticket_price = price_1
#         print(f"Ціна квитка:  {ticket_price} грн.")
#     if 6<= day <=7:
#         if age < 0:
#             ticket_price = 0
#         elif 6 <= age <= 12:
#             ticket_price = price_2 * 0.5
#         elif age >= 60:
#             ticket_price = price_2 * 0.7
#         else:
#             ticket_price = price_2
#         print(f"Ціна квитка:  {ticket_price} грн.")
# else:
#     print("Помилка вводу")
#
#
# # Завдання 3: «Пора року за номером місяця» (match)
# # Умова
# # Користувач вводить номер місяця month (1–12). Вивести пору року і назву кварталу.
# # Вимоги (що зробити)
# # Зчитати month (int).
# # Використати match month:
# # 12, 1, 2 → Зима
# # 3, 4, 5 → Весна
# # 6, 7, 8 → Літо
# # 9, 10, 11 → Осінь
# # інакше → Невірний місяць
# # Додатково визначити квартал:
# # 1–3 → Q1, 4–6 → Q2, 7–9 → Q3, 10–12 → Q4
# # Приклад вводу/виводу
# # Ввід (що вводять):
# # Введіть номер місяця (1-12): 4
# # Вивід (що вивести):
# # Пора року: Весна
# # Квартал: Q2
# # Додаткові коментарі (рекомендації)
# # Квартал можна зробити через if/elif/else, а пору року - через match.
# # Без списків/словників.
#
# month = int(input("Введіть номер місяця (1-12): "))
# match month:
#     case 12 | 1 | 2:
#         print("Зима")
#     case 3 | 4 | 5:
#         print("Весна")
#     case 6 | 7 | 8:
#         print("Літо")
#     case 9 |10 | 11:
#         print("Осінь")
#     case _:
#         print("Невірний місяць")
# match month:
#     case 1 | 2 | 3:
#         print("Квартал: Q1")
#     case 4 | 5 | 6:
#         print("Квартал: Q2")
#     case 7 | 8 | 9:
#         print("Квартал: Q3")
#     case 10 | 11 | 12:
#         print("Квартал: Q4")
#
#
#
# # Завдання 4: «Індекс маси тіла (BMI)»
# # Умова
# # Користувач вводить вагу (кг) і зріст (м). Порахувати BMI і вивести категорію.
# # Вимоги (що зробити)
# # Зчитати:
# # weight (float)
# # height (float)
# # Обчислити bmi = weight / (height * height)
# # Визначити категорію:
# # bmi < 18.5 → Недостатня вага
# # 18.5 <= bmi < 25 → Норма
# # 25 <= bmi < 30 → Надлишкова вага
# # bmi >= 30 → Ожиріння
# # Вивести BMI і категорію.
# # Приклад вводу/виводу
# # Ввід (що вводять):
# # Введіть вагу (кг): 72
# # Введіть зріст (м): 1.78
# # Вивід (що вивести):
# # BMI: 22.72
# # Категорія: Норма
# # Додаткові коментарі (рекомендації)
# # Якщо height <= 0 або weight <= 0 - Помилка вводу.
# # Для виводу BMI достатньо round(bmi, 2) (це функція, не метод).
#
# weight  = float(input("Введіть вагу (кг): "))
# height = float(input("Введіть зріст (м): "))
# bmi = round(weight/(height * height),2)
# print("BMI: ", bmi)
# if bmi < 18.5:
#     print("Категорія: Недостатня вага")
# elif 18.5 <= bmi < 25:
#     print("Категорія: Норма")
# elif 25 <= bmi < 30:
#     print("Категорія: Надлишкова вага")
# elif bmi >= 30:
#     print("Категорія: Ожиріння")
# else:
#     if height <= 0 or weight <= 0:
#         print("Помилка вводу")
#
#
#
# # Завдання 5: «Середнє без дробів + isinstance»
# # Умова
# # Користувач вводить три цілі числа. Якщо середнє значення виходить цілим - вивести як int,
# # інакше — як float. Також вивести тип результату через isinstance.
# # Вимоги (що зробити)
# # Зчитати a, b, c (int).
# # Обчислити s = a + b + c.
# # Якщо s ділиться на 3 без остачі (s % 3 == 0):
# # avg = s // 3 (буде int)
# # інакше:
# # avg = s / 3 (буде float)
# # Перевірити тип:
# # якщо isinstance(avg, int) - вивести Тип: int
# # інакше якщо isinstance(avg, float) - вивести Тип: float
# # Вивести avg.
# # Приклад вводу/виводу
# # Ввід (що вводять):
# # Введіть a: 10
# # Введіть b: 11
# # Введіть c: 12
# # Вивід (що вивести):
# # Середнє: 11
# # Тип: int
# # Додаткові коментарі (рекомендації)
# # Це завдання спеціально тренує різницю між / і //, модуль %, та isinstance.
# # Не використовувати try/except, методи, контейнери.
#
# a = int(input("Введіть a: "))
# b = int(input("Введіть b: "))
# c = int(input("Введіть c: "))
#
# s = a + b + c
# if s % 3 == 0:
#     avg = s // 3
#     print(type(avg))
#     print("Середнє: ", avg)
# else:
#     avg = s / 3
#     print(type(avg))
#     print("Середнє: ", avg)

#Завдання 6.
# Умова
# Користувач вводить ціле число n від 1 до 10000(сума для зняття).Програма має “видати” цю суму
# і показати її: цифрами словами(у дужках)
# Приклад: Введіть суму для зняття: 1981
# Знято: 1981(тисяча дев'ятсот вісімдесят один)

amount = int(input("Enter amount to withdraw from 1 to 10 000"))
n5 = amount % 10
n4 = (amount // 10) % 10
n3 = (amount // 100) % 10
n2 = (amount // 1000) % 10
n1 = amount // 10000

n1_amount = ""
n2_amount = ""
n3_amount = ""
n4_amount = ""
n5_amount = ""

#print(f"{n1}, \n{n2}, \n{n3}, \n{n4}, \n{n5}")
if amount <= 10000 and isinstance(amount, int):
    if n1 == 1:
        n1_amount = "десять тисяч гривень"
    else:
        if n2 > 0:
            match n2:
                case 1:
                    n2_amount = "тисяча"
                case 2:
                    n2_amount = "дві тисячі"
                case 3:
                    n2_amount = "три тисячі"
                case 4:
                    n2_amount = "чотири тисячі"
                case 5:
                    n2_amount = "пʼять тисяч"
                case 6:
                    n2_amount = "шість тисяч"
                case 7:
                    n2_amount = "сім тисяч"
                case 8:
                    n2_amount = "вісім тисяч"
                case 9:
                    n2_amount = "девʼять тисяч"
        if n3 > 0:
            match n3:
                case 1:
                    n3_amount = "сто"
                case 2:
                    n3_amount = "двісті"
                case 3:
                    n3_amount = "триста"
                case 4:
                    n3_amount = "чотириста"
                case 5:
                    n3_amount = "пʼятсот"
                case 6:
                    n3_amount = "шістсот"
                case 7:
                    n3_amount = "сімсот"
                case 8:
                    n3_amount = "вісімсот"
                case 9:
                    n3_amount = "девʼятсот"
        if n4 == 1 and n5 == 0:
            n4_amount = "десять"
        if n4 == 1 and n5 > 0:
            match n5:
                case 1:
                    n4_amount = "одинадцять"
                case 2:
                    n4_amount = "дванадцять"
                case 3:
                    n4_amount = "тринадцять"
                case 4:
                    n4_amount = "чотирнадцять"
                case 5:
                    n4_amount = "пʼятнадцять"
                case 6:
                    n4_amount = "шістнадцять"
                case 7:
                    n4_amount = "сімнадцять"
                case 8:
                    n4_amount = "вісімнадцять"
                case 9:
                    n4_amount = "девʼятнадцять"
        if 1 < n4 <=9:
            match n4:
                case 2:
                    n4_amount = "двадцять"
                case 3:
                    n4_amount = "тридцять"
                case 4:
                    n4_amount = "сорок"
                case 5:
                    n4_amount = "пʼятдесят"
                case 6:
                    n4_amount = "шістдесят"
                case 7:
                    n4_amount = "сімдесят"
                case 8:
                    n4_amount = "вісімдесят"
                case 9:
                    n4_amount = "девʼяносто"
        if 1<= n5 <= 9:
            match n5:
                case 1:
                    n5_amount = "один"
                case 2:
                    n5_amount = "два"
                case 3:
                    n5_amount = "три"
                case 4:
                    n5_amount = "чотири"
                case 5:
                    n5_amount = "пʼять"
                case 6:
                    n5_amount = "шість"
                case 7:
                    n5_amount = "сім"
                case 8:
                    n5_amount = "вісім"
                case 9:
                    n5_amount = "девʼять"
    print(f"{amount} : ({n1_amount} {n2_amount} {n3_amount} {n4_amount} {n5_amount})")
else:
    print("Wrong amount")