# def count_by(x, n):
#     """
#     Return a sequence of numbers counting by `x` `n` times.
#
#     """
#     test.assert_equals(count_by(1, 5), [1, 2, 3, 4, 5])
#     test.assert_equals(count_by(2, 5), [2, 4, 6, 8, 10])
#     test.assert_equals(count_by(3, 5), [3, 6, 9, 12, 15])
#     test.assert_equals(count_by(50, 5), [50, 100, 150, 200, 250])
#     test.assert_equals(count_by(100, 5), [100, 200, 300, 400, 500])

# x = int(input("x = "))
# n = int(input("n = "))
# l = list()
#
# for i in range(1, n+1):
#     l.append(x*i)
# print(l)

# Given a set of numbers, return the additive inverse of each. Each positive becomes negatives, and the negatives
# become positives.

# [1, 2, 3, 4, 5] --> [-1, -2, -3, -4, -5]
# [1, -2, 3, -4, 5] --> [-1, 2, -3, 4, -5]
# [] --> []

# t = input("Enter list of positive or negative numbers separated by spaces ").replace(",","").split()
# # print(t)
# num = 0
# new_list = list()
# for element in t:
#     if t:
#         num = int(element)
#         if num != 0:
#             num = num * (-1)
#         elif num == 0:
#             num = 0
#         new_list.append(num)
#     else:
#         print(t)
# print(new_list)

# Завдання 1
# Користувач з клавіатури вводить елементи списку цілих. Необхідно порахувати суму всіх елементів та їхнє
# середньоарифметичне. Результати вивести на екран.
#
# Завдання 2
# Користувач з клавіатури вводить елементи списку цілих і деяке число. Необхідно порахувати скільки разів дане
# число присутнє у списку. Результат вивести на екран.
#
# Завдання 3
# Користувач з клавіатури вводить список чисел. Необхідно знайти суму всіх додатних чисел у списку.
# Результат вивести на екран.
#
# Завдання 4
# Користувач з клавіатури вводить список цілих чисел. Необхідно визначити індекси всіх парних чисел у списку.
# Результат вивести на екран.
#
# Завдання 5
# Є деякий текст. Реалізуйте таку функціональність
# Змінити текст таким чином, щоб кожне речення починалося з великої літери;
# Порахуйте скільки разів цифри зустрічаються в тексті;
# Порахуйте скільки разів розділові знаки зустрічаються в тексті;
# Порахуйте кількість знаків оклику в тексті.
#
# Завдання 6
# Користувач з клавіатури вводить список цілих чисел. Необхідно видалити зі списку всі елементи, що
# повторюються, залишивши тільки унікальні. Результат вивести на екран.
