
#Завдання 3:
# Користувач вводить суму в гривнях (може бути дробова, наприклад 763.28). Треба:
# перевести суму в копійки (ціле число)
# порахувати, скільки потрібно купюр/монет, щоб видати цю суму мінімальною кількістю для номіналів:
# грн: 200, 100, 50, 20, 10, 5, 2, 1
# коп: 50, 25, 10, 5, 2, 1
# Вивести кількість кожного номіналу та підсумкову кількість усіх купюр/монет.
# кількість = залишок // номінал
# залишок = залишок % номінал

# 2 variant
uah = float(input())
kop = int(round(uah*100, 2))
print(kop)
# 36
# 3600
c200 = kop // 20000 ; kop %= 20000
c100 = kop // 10000 ; kop %= 10000
c50 = kop // 5000 ; kop %= 5000
c20 = kop // 2000 ; kop %= 2000
c10 = kop // 1000 ; kop %= 1000
c5 = kop // 500 ; kop %= 500
c2 = kop // 200 ; kop %= 200
c1 = kop // 100 ; kop %= 100

k50 = kop // 50 ; kop %= 50
k25 = kop // 25 ; kop %= 25
k10 = kop // 10 ; kop %= 10
k5 = kop // 5 ; kop %= 5
k2 = kop // 2 ; kop %= 2
k1 = kop // 1 ; kop %= 1


